-- MySQL dump 10.13  Distrib 8.0.15, for Win64 (x86_64)
--
-- Host: localhost    Database: stocktrading
-- ------------------------------------------------------
-- Server version	8.0.15

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
 SET NAMES utf8mb4 ;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `news`
--

DROP TABLE IF EXISTS `news`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
 SET character_set_client = utf8mb4 ;
CREATE TABLE `news` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(100) NOT NULL,
  `url` varchar(200) DEFAULT NULL,
  `content` longtext NOT NULL,
  `read` int(11) DEFAULT NULL,
  `news_time` date NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=50 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `news`
--

LOCK TABLES `news` WRITE;
/*!40000 ALTER TABLE `news` DISABLE KEYS */;
INSERT INTO `news` VALUES (33,'空袭又致6人死亡！美国增兵 华盛顿进入戒备状态！战火蔓延资本市场','','据伊拉克国家电视台报道，在伊朗伊斯兰革命卫队高级将领苏莱马尼等人遭美国空袭身亡后，当地时间3日晚间，首都巴格达再次遭到美军空袭。空袭造成6人死亡，另有3人重伤。当天，伊朗方面表示，将在“合适的时间和地点”对美国进行报复，美国必须为此承担一切后果。《央视财经》\r\n',10,'2020-01-07'),(34,'全球震动！伊朗少将被杀后 特朗普又有新动作！黄金石油开启暴走模式','','综合各大媒体消息，当地时间1月3日，伊拉克巴格达机场附近，伊朗伊斯兰革命卫队“圣城旅”指挥官卡西姆·苏莱曼尼将军在一场空袭中身亡。美国五角大楼表示，美国总统特朗普下令“杀死”伊朗伊斯兰革命卫队“圣城旅”指挥官苏莱曼尼将军，并形容这是“为保护美国驻外人员而采取的决定性防御行动”。（券商中国）\n',10,'2020-01-07'),(35,'银保监会：多渠道促进居民储蓄有效转化为资本市场长期资金','','银保监会近日印发关于推动银行业和保险业高质量发展的指导意见。意见指出，保险机构要回归风险保障本源，发挥经济“减震器”和社会“稳定器”作用，更好地为经济社会发展提供风险保障和长期稳定资金。大力发展企业年金、职业年金、各类健康和养老保险业务，多渠道促进居民储蓄有效转化为资本市场长期资金。（证券时报）\n',10,'2020-01-07'),(36,'美伊冲突再度升温！国际油价大涨 A股原油板块再现涨停股','','美伊冲突引发原油市场担忧，美、布两大国际油价日内一度涨逾4 %，国内原油、燃油期货均涨近4%。消息一出，石油股盘中异动，中曼石油直线封板，其他潜能恒信、石化油服、贝肯能源等均纷纷大涨。（券商中国）\n',10,'2020-01-07'),(37,'累计净流入1万亿元！北向资金持续加仓A股','','2020年首个交易日，A股迎来开门红！1月2日，A股主要股指集体大涨，上证综指盘中一度逼近3100点，深成指与创业板指大涨近2%，两市合计成交7515亿元。当日北向资金净流入超过100亿元。截至1月2日收盘，自沪深港通开通以来，北向资金累计净流入金额突破万亿元，达到10036亿元。（中国证券报）\n',10,'2020-01-07'),(38,'机构论市：量价关系暗示下周应该这样走','','周四的收市我们就指出周五市场会形成一定的休息走势，周五市场的全天来看也确实如此，逼近股指没有太明显的动静，同时成交量也是明显萎缩，稍微休息的特征比较明显。本周市场是一个跨年的市价时间段，承上启下，关键时间段呈现明显的赚钱效应。就下周而言，预计下周冲高回踩整理休息或者直接进行整理休息。\n',10,'2020-01-07'),(39,'机构论市：春季行情正徐徐展开 后市配置方向曝光','','2020年，新证券法将正式施行、创业板改革如箭在弦、各路增量资金源源而来，配置上持续看好景气改善确定性较高的科技和券商，操作上，建议继续关注底部蓝筹和科技类成长股，切勿追高，把握好节奏。\n',10,'2020-01-07'),(40,'8000亿大利好！央行宣布降准！数据解读影响 A股将这么走','','统计显示，历次央行宣布降准后，次日A股涨跌基本持平。从历史上18次央行降准来看，共计有8次沪指次日上涨，10次收跌。（证券时报）\n',10,'2020-01-07'),(41,'央行：1月6日下调金融机构存款准备金率0.5个百分点','','为支持实体经济发展，降低社会融资实际成本，中国人民银行决定于2020年1月6日下调金融机构存款准备金率0.5个百分点(不含财务公司、金融租赁公司和汽车金融公司)。（央行）\n',10,'2020-01-07'),(42,'复盘2019！32张图看懂A股牛在哪','','2019年的A股可谓否极泰来，深证成指涨幅高居全球第二！我们用32张图，和你一起复盘2019年，一起回味那些让我们激动的点点滴滴。\n',10,'2020-01-07'),(43,'加大养老金入市力度！22个省份超万亿养老金委托入市','','作为社保领域改革的重要一环，基本养老保险制度改革有望加快推进。12月30日，在中国社科院社会保障论坛暨《中国养老金发展报告2019》发布式上，《经济参考报》记者获悉，相关部门正加紧谋划基本养老保险制度改革。据多位权威人士透露，除推进基本养老保险基金全国统筹、全面推进机关事业单位养老保险制度改革外，养老金入市力度还将加大，城乡居民养老金投资将在2020年底前实现全国覆盖。（经济参考报）\n',10,'2020-01-07'),(44,'机构论市：跨年行情还能持续多久？','','结合历年市场走势，一季度往往有不错的表现，尤其是2月份，市场上涨概率较高。而此次11月底启动的行情，如果一路上行头也不回的话，预计一季度都会有比较好的延续性。而如果途中有调整，那么就看好2月份的行请。\n',10,'2020-01-07'),(45,'统计局：12月制造业PMI为50.2% 非制造业PMI为53.5%','','统计局最新披露的数据显示，12月份，中国制造业采购经理指数(PMI)为50.2%，与上月持平。非制造业PMI为53.5%。（国家统计局）\n',10,'2020-01-07'),(46,'“牛市旗手”全面暴动：狂涨1500亿！六大重磅利好护航 2020牛市行情提前发动？','','2019年的最后第二个交易日，A股华丽丽上演一波V形大逆转！当日，被视为“牛市旗手”的券商股担当领涨主力，板块掀起放量大涨的凶猛攻势，近3万亿证券板块涨幅超5%以上，单日市值暴涨超1500亿元。龙头股中信证券强势封上涨停，成交额超100亿。截至收盘中信证券报收25.66元，超8万手买单封在涨停板上。（中国基金报）\n',10,'2020-01-07'),(47,'十大券商策略：多项政策发布 长牛再添筹码！明年1月大金融或率先“躁动”','','近期政策暖风频吹，短期经济预期对市场扰动减小。1月份实际可减持规模预计为240亿元，占总解禁规模的3.5%。同时，短期内增量资金仍有流入惯性，节前资金面有支撑。预计节前“小康牛”行情的预演仍将持续；1月后期潜在外部和业绩风险开始出现，市场热度逐渐减弱。（券商中国）\n',10,'2020-01-07'),(48,'证监会：贯彻新证券法 修改完善配套规则','','2019年12月28日，第十三届全国人大常委会第十五次会议审议通过了修订后的《中华人民共和国证券法》。新证券法将于2020年3月1日起施行。证监会表示，将认真学习、贯彻新证券法，全面理解和掌握新证券法规定的有关制度和措施，加快制定、修改完善配套规章制度，完善证券市场基础制度，严格执行好法律修改后的各项规定，不断提高监管执法工作水平，充分发挥新证券法在推进市场改革、维护市场秩序、强化市场功能、保障投资者合法权益等方面的积极作用。（证券时报）\n',10,'2020-01-07'),(49,'测试',NULL,'这条信息仅仅用来测试',10,'2020-01-07');
/*!40000 ALTER TABLE `news` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2020-01-07 19:42:27
